china-djyos/djyos/third/firmware/bk7251drv/driver/common/reg/reg_mdm_stat.h
/**
 * @file reg_mdm_stat.h
 * @brief Definitions of the MDM HW block registers and register access functions.
 *
 * @defgroup REG_MDM_STAT REG_MDM_STAT
 * @ingroup REG
 * @{
 *
 * @brief Definitions of the MDM HW block registers and register access functions.
 */
#ifndef _REG_MDM_STAT_H_
#define _REG_MDM_STAT_H_

#include "co_int.h"
#include "_reg_mdm_stat.h"
#include "compiler.h"
#include "driver/entry/arch.h"      //lst
#include "reg_access.h"

/** @brief Number of registers in the REG_MDM_STAT peripheral.
 */
#define REG_MDM_STAT_COUNT 27

/** @brief Decoding mask of the REG_MDM_STAT peripheral registers from the CPU point of view.
 */
#define REG_MDM_STAT_DECODING_MASK 0x0000007F

/**
 * @name NXVERSION register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            PHYConfig   0x0
 * </pre>
 *
 * @{
 */

/// Address of the NXVERSION register
#define MDM_NXVERSION_ADDR   0x01000000
/// Offset of the NXVERSION register from the base address
#define MDM_NXVERSION_OFFSET 0x00000000
/// Index of the NXVERSION register
#define MDM_NXVERSION_INDEX  0x00000000
/// Reset value of the NXVERSION register
#define MDM_NXVERSION_RESET  0x00000000

/**
 * @brief Returns the current value of the NXVERSION register.
 * The NXVERSION register will be read and its value returned.
 * @return The current value of the NXVERSION register.
 */
__INLINE uint32_t mdm_nxversion_get(void)
{
    return REG_PL_RD(MDM_NXVERSION_ADDR);
}

// field definitions
/// PHY_CONFIG field mask
#define MDM_PHY_CONFIG_MASK   ((uint32_t)0xFFFFFFFF)
/// PHY_CONFIG field LSB position
#define MDM_PHY_CONFIG_LSB    0
/// PHY_CONFIG field width
#define MDM_PHY_CONFIG_WIDTH  ((uint32_t)0x00000020)

/// PHY_CONFIG field reset value
#define MDM_PHY_CONFIG_RST    0x0

/**
 * @brief Returns the current value of the PHYConfig field in the NXVERSION register.
 *
 * The NXVERSION register will be read and the PHYConfig field's value will be returned.
 *
 * @return The current value of the PHYConfig field in the NXVERSION register.
 */
__INLINE uint32_t mdm_phy_config_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_NXVERSION_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

/// @}

/**
 * @name TDOFFSETSTAT0 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  20:00        COARSEFOANGLE   0x0
 * </pre>
 *
 * @{
 */

/// Address of the TDOFFSETSTAT0 register
#define MDM_TDOFFSETSTAT0_ADDR   0x01000004
/// Offset of the TDOFFSETSTAT0 register from the base address
#define MDM_TDOFFSETSTAT0_OFFSET 0x00000004
/// Index of the TDOFFSETSTAT0 register
#define MDM_TDOFFSETSTAT0_INDEX  0x00000001
/// Reset value of the TDOFFSETSTAT0 register
#define MDM_TDOFFSETSTAT0_RESET  0x00000000

/**
 * @brief Returns the current value of the TDOFFSETSTAT0 register.
 * The TDOFFSETSTAT0 register will be read and its value returned.
 * @return The current value of the TDOFFSETSTAT0 register.
 */
__INLINE uint32_t mdm_tdoffsetstat0_get(void)
{
    return REG_PL_RD(MDM_TDOFFSETSTAT0_ADDR);
}

// field definitions
/// COARSEFOANGLE field mask
#define MDM_COARSEFOANGLE_MASK   ((uint32_t)0x001FFFFF)
/// COARSEFOANGLE field LSB position
#define MDM_COARSEFOANGLE_LSB    0
/// COARSEFOANGLE field width
#define MDM_COARSEFOANGLE_WIDTH  ((uint32_t)0x00000015)

/// COARSEFOANGLE field reset value
#define MDM_COARSEFOANGLE_RST    0x0

/**
 * @brief Returns the current value of the COARSEFOANGLE field in the TDOFFSETSTAT0 register.
 *
 * The TDOFFSETSTAT0 register will be read and the COARSEFOANGLE field's value will be returned.
 *
 * @return The current value of the COARSEFOANGLE field in the TDOFFSETSTAT0 register.
 */
__INLINE uint32_t mdm_coarsefoangle_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TDOFFSETSTAT0_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x001FFFFF)) == 0);
    return (localVal >> 0);
}

/// @}

/**
 * @name TDOFFSETSTAT1 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  20:00          FINEFOANGLE   0x0
 * </pre>
 *
 * @{
 */

/// Address of the TDOFFSETSTAT1 register
#define MDM_TDOFFSETSTAT1_ADDR   0x01000008
/// Offset of the TDOFFSETSTAT1 register from the base address
#define MDM_TDOFFSETSTAT1_OFFSET 0x00000008
/// Index of the TDOFFSETSTAT1 register
#define MDM_TDOFFSETSTAT1_INDEX  0x00000002
/// Reset value of the TDOFFSETSTAT1 register
#define MDM_TDOFFSETSTAT1_RESET  0x00000000

/**
 * @brief Returns the current value of the TDOFFSETSTAT1 register.
 * The TDOFFSETSTAT1 register will be read and its value returned.
 * @return The current value of the TDOFFSETSTAT1 register.
 */
__INLINE uint32_t mdm_tdoffsetstat1_get(void)
{
    return REG_PL_RD(MDM_TDOFFSETSTAT1_ADDR);
}

// field definitions
/// FINEFOANGLE field mask
#define MDM_FINEFOANGLE_MASK   ((uint32_t)0x001FFFFF)
/// FINEFOANGLE field LSB position
#define MDM_FINEFOANGLE_LSB    0
/// FINEFOANGLE field width
#define MDM_FINEFOANGLE_WIDTH  ((uint32_t)0x00000015)

/// FINEFOANGLE field reset value
#define MDM_FINEFOANGLE_RST    0x0

/**
 * @brief Returns the current value of the FINEFOANGLE field in the TDOFFSETSTAT1 register.
 *
 * The TDOFFSETSTAT1 register will be read and the FINEFOANGLE field's value will be returned.
 *
 * @return The current value of the FINEFOANGLE field in the TDOFFSETSTAT1 register.
 */
__INLINE uint32_t mdm_finefoangle_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TDOFFSETSTAT1_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x001FFFFF)) == 0);
    return (localVal >> 0);
}

/// @}

/**
 * @name FDTOFFSETSTAT0 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  29:12         STOSLOPESTAT   0x0
 *  05:00       TDSYNCHOFFSTAT   0x0
 * </pre>
 *
 * @{
 */

/// Address of the FDTOFFSETSTAT0 register
#define MDM_FDTOFFSETSTAT0_ADDR   0x0100000C
/// Offset of the FDTOFFSETSTAT0 register from the base address
#define MDM_FDTOFFSETSTAT0_OFFSET 0x0000000C
/// Index of the FDTOFFSETSTAT0 register
#define MDM_FDTOFFSETSTAT0_INDEX  0x00000003
/// Reset value of the FDTOFFSETSTAT0 register
#define MDM_FDTOFFSETSTAT0_RESET  0x00000000

/**
 * @brief Returns the current value of the FDTOFFSETSTAT0 register.
 * The FDTOFFSETSTAT0 register will be read and its value returned.
 * @return The current value of the FDTOFFSETSTAT0 register.
 */
__INLINE uint32_t mdm_fdtoffsetstat0_get(void)
{
    return REG_PL_RD(MDM_FDTOFFSETSTAT0_ADDR);
}

